app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("name", "block", "floor", "flat", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "PradeepKumar.P"], ["block", "B"], ["floor", 1], ["flat", 12], ["created_at", "2018-10-29 10:35:45.778468"], ["updated_at", "2018-10-29 10:35:45.778468"]]

  def update
    respond_to do |format|
      if @member.update(member_params)
---
UPDATE "members" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["encrypted_password", "$2a$11$qHJqGPoieInoWCSM4lw.uOF7aqNu4cUttN0occc5kSjlcJgyy8652"], ["updated_at", "2018-11-12 07:21:47.983814"], ["id", 1]]

  def destroy
    @member.destroy
---
DELETE FROM "members" WHERE "members"."id" = $1  [["id", 11]]

  def update_password
    respond_to do |format|
      if @member.update_with_password(member_params)
---
UPDATE "members" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["encrypted_password", "$2a$11$HGzZOayBg9QmTteqdYCs2.u8qk34T8XKKO5Dv287WWXlfZa6DN7Oa"], ["updated_at", "2018-11-19 18:30:55.597386"], ["id", 14]]

    def set_member
      @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = $1 ORDER BY "members"."id" ASC LIMIT $2  [["id", 14], ["LIMIT", 1]]